Revit 2024 API
ElectricalSystem.Ways Property
 The circuit ways used in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public int Ways { get; }
Visual Basic
Public ReadOnly Property Ways As Integer
	Get
Visual C++
public:
property int Ways {
	int get ();
}
Remarks
 This property is used to retrieve the ways of the Electrical System on a panel.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace